pwbf/RX64M_ETHERNET/r_usb_hmsc/src/r_usb_hmsc_driver.c
/***********************************************************************************************************************
* DISCLAIMER
* This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No
* other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all
* applicable laws, including copyright laws.
* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
* THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY,
* FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM
* EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES
* SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS
* SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of
* this software. By using this software, you agree to the additional terms and conditions found by accessing the
* following link:
* http://www.renesas.com/disclaimer
*
* Copyright (C) 2014(2015) Renesas Electronics Corporation. All rights reserved.
***********************************************************************************************************************/
/***********************************************************************************************************************
* File Name    : r_usb_hmsc_driver.c
* Description  : USB Host MSC BOT driver
***********************************************************************************************************************/
/**********************************************************************************************************************
* History : DD.MM.YYYY Version Description
*         : 04.01.2014 1.00 First Release
*         : 30.01.2015 1.01    Support Multi device.
***********************************************************************************************************************/

/******************************************************************************
Includes   <System Includes> , "Project Includes"
******************************************************************************/
#include "r_usb_basic_if.h"
#include "r_usb_hatapi_define.h"    /* Peripheral ATAPI Device extern */
#include "r_usb_hmsc_define.h"      /* Host Mass Storage Class Driver */
#include "r_usb_hmsc_extern.h"      /* Host MSC grobal define */
#include "r_usb_api.h"
#include "r_usb_hmsc_config.h"
#include "r_usb_hmsc_if.h"

/******************************************************************************
Private global variables and functions
******************************************************************************/
uint16_t usb_ghmsc_DefEpTbl[USB_NUM_USBIP][USB_EPL+1] =
{
  {  /* USB IP No.0 */
    USB_NONE,
    USB_NONE,
    USB_NONE,
    USB_NONE,
    USB_NONE,
    USB_NONE,
    USB_PDTBLEND /* Pipe end */
  },
  {  /* USB IP No.1 */
    USB_NONE,
    USB_NONE,
    USB_NONE,
    USB_NONE,
    USB_NONE,
    USB_NONE,
    USB_PDTBLEND /* Pipe end */
  }
};

uint8_t             usb_ghmsc_Data[USB_NUM_USBIP][5120];
USB_UTR_t           usb_ghmsc_TransData[USB_NUM_USBIP][USB_MAXSTRAGE];     /* Send data transfer message */
USB_UTR_t           usb_ghmsc_ReceiveData[USB_NUM_USBIP][USB_MAXSTRAGE];   /* Receive data transfer message */
USB_UTR_t           usb_ghmsc_ControlData[USB_NUM_USBIP];                  /* Control data transfer message */
uint16_t            usb_ghmsc_OutPipe[USB_NUM_USBIP][USB_MAXSTRAGE][2];    /* Pipenumber / Pipectr(SQTGL) */
uint16_t            usb_ghmsc_InPipe[USB_NUM_USBIP][USB_MAXSTRAGE][2];     /* Pipenumber / Pipectr(SQTGL) */
uint16_t            usb_shmsc_MsgNum[USB_NUM_USBIP];
USB_MSC_CBW_t       usb_ghmsc_Cbw[USB_NUM_USBIP][USB_MAXSTRAGE];           /* CBW headder */
USB_MSC_CSW_t       usb_ghmsc_Csw[USB_NUM_USBIP][USB_MAXSTRAGE];           /* CSW headder */
uint32_t            usb_ghmsc_CbwTagNo[USB_NUM_USBIP][USB_MAXSTRAGE];      /* CBW tag number */
uint8_t             usb_ghmsc_AtapiFlag[USB_NUM_USBIP][USB_MAXSTRAGE];
uint16_t            usb_ghmsc_AttSts[USB_MAXSTRAGE];
uint32_t            usb_ghmsc_TransSize[USB_NUM_USBIP];
uint8_t             *usb_ghmsc_Buff[USB_NUM_USBIP];
uint16_t            usb_shmsc_Process[USB_NUM_USBIP];
uint16_t            usb_shmsc_NoDataSeq[USB_NUM_USBIP]                      = { USB_SEQ_0, USB_SEQ_0 };
uint16_t            usb_shmsc_DataInSeq[USB_NUM_USBIP]                      = { USB_SEQ_0, USB_SEQ_0 };
uint16_t            usb_shmsc_DataOutSeq[USB_NUM_USBIP]                     = { USB_SEQ_0, USB_SEQ_0 };
uint16_t            usb_shmsc_StallErrSeq[USB_NUM_USBIP]                    = { USB_SEQ_0, USB_SEQ_0 };
uint16_t            usb_shmsc_DataStallSeq[USB_NUM_USBIP]                   = { USB_SEQ_0, USB_SEQ_0 };
uint16_t            usb_ghmsc_RootDrive[USB_NUM_USBIP];
uint16_t            usb_ghmsc_CswErrRoop[USB_NUM_USBIP]                     = { USB_OFF, USB_OFF };
uint16_t            usb_ghmsc_drive_no[USB_NUM_USBIP][USB_MAXDEVADDR];
DRIVE_MANAGEMENT_t  usb_ghmsc_drv_no_tbl[USB_DEVICENUM];             /* Drive no. management table */

uint8_t             *usb_ghmsc_DeviceTable[USB_NUM_USBIP];
uint8_t             *usb_ghmsc_ConfigTable[USB_NUM_USBIP];
uint8_t             *usb_ghmsc_InterfaceTable[USB_NUM_USBIP];
uint16_t            usb_ghmsc_Speed[USB_NUM_USBIP];
uint16_t            usb_ghmsc_Devaddr[USB_NUM_USBIP];
uint16_t            usb_shmsc_InitSeq[USB_NUM_USBIP]                        = { USB_SEQ_0, USB_SEQ_0 };
uint16_t            *usb_ghmsc_PipeTable[USB_NUM_USBIP];                   /* Pipe Table(DefEP) */

/*----------------*/
/* Storage Driver */
/*----------------*/
USB_UTR_t           usb_shmsc_ClassControl[USB_NUM_USBIP];
USB_CB_t            usb_shmsc_command_result[USB_NUM_USBIP];
uint16_t            usb_ghmsc_DriveChk[USB_MAXDRIVE + 1][6];
uint16_t            usb_shmsc_ClassRequest[USB_NUM_USBIP][5];
uint8_t             usb_shmsc_DeviceReady[USB_MAXUNITNUM];
uint8_t             usb_ghmsc_ClassData[USB_NUM_USBIP][USB_HMSC_CLSDATASIZE];

/* Yes/No, Unit Number, Partition Number, device address, EPtbl offset */
uint32_t            usb_ghmsc_MaxLUN[USB_NUM_USBIP];
uint16_t            usb_ghmsc_StrgCount;
uint16_t            usb_ghmsc_MaxDrive;
uint16_t            usb_shmsc_StrgProcess[USB_NUM_USBIP]                    = { USB_NONE, USB_NONE };
uint16_t            usb_shmsc_StrgDriveSearchSeq[USB_NUM_USBIP]             = { USB_SEQ_0, USB_SEQ_0 };
uint16_t            usb_shmsc_StrgDriveSearchErrCount[USB_NUM_USBIP]        = { USB_SEQ_0, USB_SEQ_0 };
uint16_t            usb_shmsc_StrgDriveSearchCount[USB_NUM_USBIP]           = { USB_SEQ_0, USB_SEQ_0 };

