pwbf/RX64M_ETHERNET/r_usb_hmsc/src/r_usb_hmsc_driver.c
/* Read Sector */
uint16_t            usb_shmsc_DevReadSectorSizeSeq[USB_NUM_USBIP]           = { USB_SEQ_0, USB_SEQ_0 };
uint16_t            usb_shmsc_DevReadSectorSizeErrCount[USB_NUM_USBIP]      = { USB_SEQ_0, USB_SEQ_0 };
uint16_t            usb_shmsc_DevReadPartitionSeq[USB_NUM_USBIP]            = { USB_SEQ_0, USB_SEQ_0 };

/* Drive Open */
uint16_t            usb_shmsc_StrgDriveOpenSeq[USB_NUM_USBIP]               = { USB_SEQ_0, USB_SEQ_0 };
uint16_t            usb_shmsc_StrgDriveOpenCount[USB_NUM_USBIP]             = { USB_SEQ_0, USB_SEQ_0 };
uint16_t            usb_shmsc_StrgDriveOpenParCount[USB_NUM_USBIP]          = { USB_SEQ_0, USB_SEQ_0 };

/* Partition */
uint32_t            usb_shmsc_PartitionLba[USB_NUM_USBIP][USB_BOOTPARTNUM + 1u];
uint16_t            usb_ghmsc_RootDevaddr[USB_NUM_USBIP];
uint16_t            usb_shmsc_NewDrive[USB_NUM_USBIP];
uint16_t            usb_shmsc_LoopCont[USB_NUM_USBIP]                       = { USB_SEQ_0, USB_SEQ_0 };
uint16_t            usb_shmsc_Unit[USB_NUM_USBIP];
uint16_t            usb_ghmsc_PartTransSize[USB_NUM_USBIP];
uint8_t             usb_shmsc_PartitionInfo[USB_NUM_USBIP][USB_BOOTPARTNUM];


/******************************************************************************
Renesas Abstracted HMSC Driver functions
******************************************************************************/

/******************************************************************************
Function Name   : usb_hmsc_Task
Description     : USB HMSC Task
Arguments       : none
Return value    : none
******************************************************************************/
void usb_hmsc_Task(void)
{
    USB_UTR_t       *mess;
    /* Error code */
    USB_ER_t        err;

    /* Receive message */
    err = R_USB_TRCV_MSG( USB_HMSC_MBX, (USB_MSG_t**)&mess, (uint16_t)0 );
    if( err != USB_E_OK )
    {
        return;
    }

    switch( mess->msginfo )
    {
    case USB_MSG_CLS_INIT:
        usb_hmsc_ClassCheck(mess, (USB_CLSINFO_t *)mess);
        break;

    case USB_MSG_HMSC_NO_DATA:
        usb_hmsc_NoDataAct((USB_CLSINFO_t *)mess);
        break;
    case USB_MSG_HMSC_DATA_IN:
        usb_hmsc_DataInAct((USB_CLSINFO_t *)mess);
        break;
    case USB_MSG_HMSC_DATA_OUT:
        usb_hmsc_DataOutAct((USB_CLSINFO_t *)mess);
        break;
    case USB_MSG_HMSC_DATA_STALL:
        usb_hmsc_DataStall((USB_UTR_t *)mess);
        break;
    case USB_MSG_HMSC_CBW_ERR:
        usb_hmsc_StallErr((USB_UTR_t *)mess);
        break;      
    case USB_MSG_HMSC_CSW_PHASE_ERR:
        usb_hmsc_StallErr((USB_UTR_t *)mess);
        break;
/* enumeration waiting of other device */
    case USB_MSG_CLS_WAIT:
        usb_hmsc_ClassWait(USB_HMSC_MBX, mess);
        break;
    default:
        break;
    }
    err = R_USB_REL_BLK(USB_HMSC_MPL,(USB_MH_t)mess);
    if( err != USB_E_OK )
    {
        USB_PRINTF0("### USB Strg Task rel_blk error\n");
    }
}   /* eof usb_hmsc_Task() */


/******************************************************************************
Function Name   : usb_hmsc_SetRwCbw
Description     : CBW parameter initialization for the READ10/WRITE10 command
Arguments       : uint16_t command : 
                : uint32_t secno : 
                : uint16_t seccnt : 
                : uint32_t trans_byte : 
                : uint16_t side : 
Return value    : none
******************************************************************************/
void usb_hmsc_SetRwCbw(USB_UTR_t *ptr, uint16_t command, uint32_t secno, uint16_t seccnt,
     uint32_t trans_byte, uint16_t side)
{
    uint16_t    msgnum;

    /* Data IN */
    msgnum = usb_hmsc_SmpDrive2Msgnum(ptr, side);
    if( USB_ERROR == msgnum )
    {
        return;
    }

    /* CBW parameter set */
    usb_ghmsc_Cbw[ptr->ip][msgnum].dCBWTag = usb_ghmsc_CbwTagNo[ptr->ip][msgnum];
    usb_ghmsc_Cbw[ptr->ip][msgnum].dCBWDTL_Lo = (uint8_t)trans_byte;
    usb_ghmsc_Cbw[ptr->ip][msgnum].dCBWDTL_ML = (uint8_t)(trans_byte >> 8);
    usb_ghmsc_Cbw[ptr->ip][msgnum].dCBWDTL_MH = (uint8_t)(trans_byte >> 16);
    usb_ghmsc_Cbw[ptr->ip][msgnum].dCBWDTL_Hi = (uint8_t)(trans_byte >> 24);
    usb_ghmsc_Cbw[ptr->ip][msgnum].bmCBWFlags.CBWdir = 0;
    usb_ghmsc_Cbw[ptr->ip][msgnum].bmCBWFlags.reserved7 = 0;
    usb_ghmsc_Cbw[ptr->ip][msgnum].bCBWLUN.bCBWLUN = usb_hmsc_SmpDrive2Unit(ptr, side);
    usb_ghmsc_Cbw[ptr->ip][msgnum].bCBWLUN.reserved4 = 0;
    usb_ghmsc_Cbw[ptr->ip][msgnum].bCBWCBLength.bCBWCBLength = 0;
    usb_ghmsc_Cbw[ptr->ip][msgnum].bCBWCBLength.reserved3 = 0;

    /* ATAPI_COMMAND */
    usb_ghmsc_Cbw[ptr->ip][msgnum].CBWCB[0] = (uint8_t)command;
    /* LUN */
    usb_ghmsc_Cbw[ptr->ip][msgnum].CBWCB[1] = 0x00;
    /* sector address */
    usb_ghmsc_Cbw[ptr->ip][msgnum].CBWCB[2] = (uint8_t)(secno >> 24);
    usb_ghmsc_Cbw[ptr->ip][msgnum].CBWCB[3] = (uint8_t)(secno >> 16);
    usb_ghmsc_Cbw[ptr->ip][msgnum].CBWCB[4] = (uint8_t)(secno >> 8);
    usb_ghmsc_Cbw[ptr->ip][msgnum].CBWCB[5] = (uint8_t)secno;
    /* Reserved */
    usb_ghmsc_Cbw[ptr->ip][msgnum].CBWCB[6] = 0x00;
    /* Sector length */
    usb_ghmsc_Cbw[ptr->ip][msgnum].CBWCB[7] = (uint8_t)(seccnt >> 8);
    /* Block address */
    usb_ghmsc_Cbw[ptr->ip][msgnum].CBWCB[8] = (uint8_t)seccnt;
    /* Control data */
    usb_ghmsc_Cbw[ptr->ip][msgnum].CBWCB[9] = (uint8_t)0x00;

    /* ATAPI command check */
    switch( command )
    {
    case USB_ATAPI_TEST_UNIT_READY:
    case USB_ATAPI_REQUEST_SENSE:
    case USB_ATAPI_INQUIRY:
    case USB_ATAPI_MODE_SELECT6:
    case USB_ATAPI_MODE_SENSE6:
    case USB_ATAPI_START_STOP_UNIT:
    case USB_ATAPI_PREVENT_ALLOW:
    case USB_ATAPI_READ_FORMAT_CAPACITY:
    case USB_ATAPI_READ_CAPACITY:
        USB_PRINTF0("### Non-mounted command demand generating !\n");
        break;
    /* Initialized READ CBW TAG */
    case USB_ATAPI_READ10:
        usb_ghmsc_Cbw[ptr->ip][msgnum].bmCBWFlags.CBWdir = 1;
        /* 10bytes */
        usb_ghmsc_Cbw[ptr->ip][msgnum].bCBWCBLength.bCBWCBLength = 10;
        break;
    /* Initialized WRITE CBW TAG */
    case USB_ATAPI_WRITE10:
        usb_ghmsc_Cbw[ptr->ip][msgnum].bmCBWFlags.CBWdir = 0;
        /* 10bytes */
        usb_ghmsc_Cbw[ptr->ip][msgnum].bCBWCBLength.bCBWCBLength = 10;
        break;
    case USB_ATAPI_SEEK:
    case USB_ATAPI_WRITE_AND_VERIFY:
    case USB_ATAPI_VERIFY10:
    case USB_ATAPI_MODE_SELECT10:
    case USB_ATAPI_MODE_SENSE10:
    default:
        USB_PRINTF0("### Non-mounted command demand generating !\n");
        break;
    }

    if( usb_ghmsc_AtapiFlag[ptr->ip][msgnum] == USB_ATAPI )
    {
        /* 12bytes */
        usb_ghmsc_Cbw[ptr->ip][msgnum].bCBWCBLength.bCBWCBLength
        = USB_MSC_CBWCB_LENGTH;
    }
}   /* eof usb_hmsc_SetRwCbw() */

