pwbf/RX64M_ETHERNET/r_usb_hmsc/src/r_usb_hmsc_driver.c
/******************************************************************************
Function Name   : usb_hmsc_SetElsCbw
Description     : CBW parameter initialization for other commands
Arguments       : uint8_t *data : 
                : uint32_t trans_byte : 
                : uint16_t side : 
Return value    : none
******************************************************************************/
void usb_hmsc_SetElsCbw(USB_UTR_t *ptr, uint8_t *data, uint32_t trans_byte, uint16_t side)
{
    uint8_t     i;
    uint16_t    msgnum;

    /* Data IN */
    msgnum = usb_hmsc_SmpDrive2Msgnum(ptr, side);
    if( USB_ERROR == msgnum )
    {
        return;
    }

    /* CBW parameter set */
    usb_ghmsc_Cbw[ptr->ip][msgnum].dCBWTag = usb_ghmsc_CbwTagNo[ptr->ip][msgnum];
    usb_ghmsc_Cbw[ptr->ip][msgnum].dCBWDTL_Lo = (uint8_t)trans_byte;
    usb_ghmsc_Cbw[ptr->ip][msgnum].dCBWDTL_ML = (uint8_t)(trans_byte >> 8);
    usb_ghmsc_Cbw[ptr->ip][msgnum].dCBWDTL_MH = (uint8_t)(trans_byte >> 16);
    usb_ghmsc_Cbw[ptr->ip][msgnum].dCBWDTL_Hi = (uint8_t)(trans_byte >> 24);
    /* Receive */
    usb_ghmsc_Cbw[ptr->ip][msgnum].bmCBWFlags.CBWdir = 0;
    usb_ghmsc_Cbw[ptr->ip][msgnum].bmCBWFlags.reserved7 = 0;
    usb_ghmsc_Cbw[ptr->ip][msgnum].bCBWLUN.bCBWLUN = usb_hmsc_SmpDrive2Unit(ptr, side);
    usb_ghmsc_Cbw[ptr->ip][msgnum].bCBWLUN.reserved4 = 0;
    usb_ghmsc_Cbw[ptr->ip][msgnum].bCBWCBLength.reserved3 = 0;

    for( i = 0; i < 12; i++ )
    {
        usb_ghmsc_Cbw[ptr->ip][msgnum].CBWCB[i] = data[i];
    }

    /* ATAPI command check */
    switch( data[0] )
    {
    /* No data */
    case USB_ATAPI_TEST_UNIT_READY:
        usb_ghmsc_Cbw[ptr->ip][msgnum].bCBWCBLength.bCBWCBLength = 6;
        break;
    /* Receive */
    case USB_ATAPI_REQUEST_SENSE:
        usb_ghmsc_Cbw[ptr->ip][msgnum].bmCBWFlags.CBWdir = 1;
        usb_ghmsc_Cbw[ptr->ip][msgnum].bCBWCBLength.bCBWCBLength = 6;
        break;
    /* Send */
    case USB_ATAPI_FORMAT_UNIT:
        USB_PRINTF0("### Non-mounted command demand generating !\n");
        break;
    /* Receive */
    case USB_ATAPI_INQUIRY:
        usb_ghmsc_Cbw[ptr->ip][msgnum].bmCBWFlags.CBWdir = 1;
        usb_ghmsc_Cbw[ptr->ip][msgnum].bCBWCBLength.bCBWCBLength = 6;
        break;
    case USB_ATAPI_MODE_SELECT6:
    case USB_ATAPI_MODE_SENSE6:
        break;
    /* No data */
    case USB_ATAPI_START_STOP_UNIT:
        usb_ghmsc_Cbw[ptr->ip][msgnum].bCBWCBLength.bCBWCBLength = 6;
        break;
    /* No data */
    case USB_ATAPI_PREVENT_ALLOW:
        usb_ghmsc_Cbw[ptr->ip][msgnum].bCBWCBLength.bCBWCBLength = 6;
        break;
    /* Receive */
    case USB_ATAPI_READ_FORMAT_CAPACITY:
        usb_ghmsc_Cbw[ptr->ip][msgnum].bmCBWFlags.CBWdir = 1;
        usb_ghmsc_Cbw[ptr->ip][msgnum].bCBWCBLength.bCBWCBLength = 10;
        break;
    /* Receive */
    case USB_ATAPI_READ_CAPACITY:
        usb_ghmsc_Cbw[ptr->ip][msgnum].bmCBWFlags.CBWdir = 1;
        usb_ghmsc_Cbw[ptr->ip][msgnum].bCBWCBLength.bCBWCBLength = 10;
        break;
    case USB_ATAPI_READ10:
    case USB_ATAPI_WRITE10:
        USB_PRINTF0("### Non-mounted command demand generating !\n");
        break;
    case USB_ATAPI_SEEK:
    case USB_ATAPI_WRITE_AND_VERIFY:
    case USB_ATAPI_VERIFY10:
        USB_PRINTF0("### Non-mounted command demand generating !\n");
        break;
    /* Send */
    case USB_ATAPI_MODE_SELECT10:
        USB_PRINTF0("### Non-mounted command demand generating !\n");
        break;
    /* Receive */
    case USB_ATAPI_MODE_SENSE10:
        usb_ghmsc_Cbw[ptr->ip][msgnum].bmCBWFlags.CBWdir = 1;
        usb_ghmsc_Cbw[ptr->ip][msgnum].bCBWCBLength.bCBWCBLength = 10;
        break;
    default:
        USB_PRINTF0("### Non-mounted command demand generating !\n");
        break;
    }

    if( usb_ghmsc_AtapiFlag[ptr->ip][msgnum] == USB_ATAPI )
    {
        /* 12bytes */
        usb_ghmsc_Cbw[ptr->ip][msgnum].bCBWCBLength.bCBWCBLength
        = USB_MSC_CBWCB_LENGTH;
    }
}   /* eof usb_hmsc_SetElsCbw() */

/******************************************************************************
Function Name   : usb_hmsc_CbwTagCount
Description     : Updates tag information
Arguments       : uint16_t msgnum : 
Return value    : none
******************************************************************************/
void usb_hmsc_CbwTagCount(USB_UTR_t *ptr, uint16_t msgnum)
{
    usb_ghmsc_CbwTagNo[ptr->ip][msgnum]++;
    if( usb_ghmsc_CbwTagNo[ptr->ip][msgnum] == (uint16_t)0 )
    {
        usb_ghmsc_CbwTagNo[ptr->ip][msgnum] = (uint16_t)1;
    }
}   /* eof usb_hmsc_CbwTagCount() */

/******************************************************************************
Function Name   : usb_hmsc_CheckCsw
Description     : CSW check
Arguments       : uint16_t drvnum : 
Return value    : uint16_t : 
******************************************************************************/
uint16_t usb_hmsc_CheckCsw(USB_UTR_t *ptr, uint16_t drvnum)
{
    uint16_t    msgnum;
    USB_CLSINFO_t *mess;
    
    msgnum = usb_hmsc_SmpDrive2Msgnum(ptr, drvnum);
    if( USB_ERROR == msgnum )
    {
        USB_HMSC_CSW_ERR;
    }

    /* CSW Check */
    if( usb_ghmsc_Csw[ptr->ip][msgnum].dCSWSignature != USB_MSC_CSW_SIGNATURE )
    {
        USB_PRINTF2("### CSW signature error 0x%08x:SIGN=0x%08x.\n",
             usb_ghmsc_Csw[ptr->ip][msgnum].dCSWSignature, USB_MSC_CSW_SIGNATURE);
        return USB_HMSC_CSW_ERR;
    }
    if( usb_ghmsc_Csw[ptr->ip][msgnum].dCSWTag != usb_ghmsc_Cbw[ptr->ip][msgnum].dCBWTag )
    {
        USB_PRINTF2("### CSW Tag error 0x%08x:CBWTAG=0x%08x.\n",
             usb_ghmsc_Csw[ptr->ip][msgnum].dCSWTag, usb_ghmsc_Cbw[ptr->ip][msgnum].dCBWTag);
        return USB_HMSC_CSW_ERR;
    }
    switch( usb_ghmsc_Csw[ptr->ip][msgnum].bCSWStatus )
    {
    case USB_MSC_CSW_OK:
        return USB_HMSC_OK;
        break;
    case USB_MSC_CSW_NG:
        return USB_HMSC_CSW_ERR;
        break;
    case USB_MSC_CSW_PHASE_ERR:
        usb_shmsc_Process[ptr->ip] = USB_MSG_HMSC_CSW_PHASE_ERR;
        usb_shmsc_StallErrSeq[ptr->ip] = USB_SEQ_0;
        mess->keyword = drvnum;
        usb_hmsc_SpecifiedPath((USB_CLSINFO_t *)mess );
        return USB_HMSC_CSW_PHASE_ERR;
        break;
    default:
        break;
    }
    USB_PRINTF1("### CSW status error 0x%2x.\n", usb_ghmsc_Csw[ptr->ip][msgnum].bCSWStatus);
    return USB_HMSC_CSW_ERR;
}   /* eof usb_hmsc_CheckCsw() */

