pwbf/RX64M_ETHERNET/r_usb_hmsc/src/r_usb_hmsc_driver.c
/******************************************************************************
Function Name   : usb_hmsc_SmpBotDescriptor
Description     : BOT Descriptor
Arguments       : uint8_t *table : 
                : uint16_t msgnum : 
Return value    : uint16_t : 
******************************************************************************/
uint16_t usb_hmsc_SmpBotDescriptor(USB_UTR_t *ptr, uint8_t *table, uint16_t msgnum)
{
    /* Check Descriptor */
    switch( table[1] )
    {
    /* Device Descriptor */
    case USB_DT_DEVICE:
        USB_PRINTF0("### Not Interface descriptor (Device Desc).\n");
        return USB_ERROR;
        break;
    /* Configuration Descriptor */
    case USB_DT_CONFIGURATION:
        USB_PRINTF0("### Not Interface descriptor (Config Desc).\n");
        return USB_ERROR;
        break;
    /* String Descriptor */
    case USB_DT_STRING:
        USB_PRINTF0("### Not Interface descriptor (String Desc).\n");
        return USB_ERROR;
        break;
    /* Interface Descriptor ? */
    case USB_DT_INTERFACE:
        /* Check Interface Descriptor (deviceclass) */
        if( table[5] != USB_IFCLS_MAS )
        {
            USB_PRINTF1("### Interface deviceclass is %x , not support.\n", table[5]);
            return USB_ERROR;
        }
        /* Check Interface Descriptor (subclass) */
        if( table[6] == USB_ATAPI )
        {
            USB_PRINTF0("    Interface subclass  : SFF-8070i\n");
            /* ATAPI Command */
            usb_ghmsc_AtapiFlag[ptr->ip][msgnum] = USB_ATAPI;
        }
        else if (table[6] == USB_SCSI)
        {
            USB_PRINTF0(
                "Interface subclass  : SCSI transparent command set\n");
            /* SCSI Command */
            usb_ghmsc_AtapiFlag[ptr->ip][msgnum] = USB_SCSI;
        }
        else if (table[6] == USB_ATAPI_MMC5)
        {
            USB_PRINTF0("   Interface subclass   : ATAPI command set\n");
            /* ATAPI Command */
            usb_ghmsc_AtapiFlag[ptr->ip][msgnum] = USB_ATAPI_MMC5;
        }
        else
        {
            USB_PRINTF1("### Interface subclass is %x , not support.\n", table[6]);
            /* Unknown Command */
            usb_ghmsc_AtapiFlag[ptr->ip][msgnum] = USB_NONE;
            return USB_ERROR;
        }
        /* Check Interface Descriptor (protocol) */
        if( table[7] == USB_BOTP )
        {
            USB_PRINTF0("   Interface protocol   : BOT \n");
        }
        else
        {
            USB_PRINTF1("### Interface protocol is %x , not support.\n", table[7]);
            return USB_ERROR;
        }
        /* Check Endpoint number */
        if( table[4] < USB_TOTALEP )
        {
            USB_PRINTF1("### Endpoint number is %x , less than 2.\n", table[4]);
            return USB_ERROR;
        }
        return USB_DONE;
        break;
    /* Endpoint Descriptor */
    case USB_DT_ENDPOINT:
        USB_PRINTF0("### Not Interface descrip (Endpoint Desc).\n");
        return USB_ERROR;
        break;
    /* Device Qualifier Descriptor */
    case USB_DT_DEVICE_QUALIFIER:
        USB_PRINTF0("### Not Interface descrip (Dev Qualifier Desc).\n");
        return USB_ERROR;
        break;
    /* Other Speed Configuration Descriptor */
    case USB_DT_OTHER_SPEED_CONF:
        USB_PRINTF0("### Not Interface descrip (Other Speed Config Desc).\n");
        return USB_ERROR;
        break;
    /* Interface Power Descriptor */
    case USB_DT_INTERFACE_POWER:
        USB_PRINTF0("### Not Interface descrip (Interface Power Desc).\n");
        return USB_ERROR;
        break;
    /* Not Descriptor */
    default:
        USB_PRINTF0("### Not Interface descrip ( Not Standard Desc ).\n");
        break;
    }
    return USB_ERROR;
}   /* eof usb_hmsc_SmpBotDescriptor() */

/******************************************************************************
Function Name   : usb_hmsc_SmpPipeInfo
Description     : Pipe Information
Arguments       : uint8_t *table : 
                : uint16_t msgnum : 
                : uint16_t speed : 
                : uint16_t length : 
Return value    : uint16_t : 
******************************************************************************/
uint16_t usb_hmsc_SmpPipeInfo(USB_UTR_t *ptr, uint8_t *table, uint16_t msgnum, uint16_t speed, uint16_t length)
{
    uint16_t        dirflag = 0;
    uint16_t        ofdsc, offset;
    uint16_t        retval;

    /* Check Descriptor */
    if( table[1] != USB_DT_INTERFACE )
    {
        /* Configuration Descriptor */
        USB_PRINTF0("### Not Interface descriptor.\n");
        return USB_ERROR;
    }

    offset = (uint16_t)(2u * USB_EPL * msgnum);

    /* Check Endpoint Descriptor */
    ofdsc = table[0];
    /* Pipe initial */
    usb_ghmsc_OutPipe[ptr->ip][msgnum][0]    = USB_NOPORT;
    usb_ghmsc_InPipe[ptr->ip][msgnum][0]     = USB_NOPORT;
    /* Toggle clear */
    usb_ghmsc_OutPipe[ptr->ip][msgnum][1]    = 0;
    usb_ghmsc_InPipe[ptr->ip][msgnum][1]     = 0;
    while( ofdsc < (length - table[0]) )
    {
        /* Search within Interface */
        switch( table[ofdsc + 1] )
        {
        /* Device Descriptor ? */
        case USB_DT_DEVICE:
        /* Configuration Descriptor ? */
        case USB_DT_CONFIGURATION:
        /* String Descriptor ? */
        case USB_DT_STRING:
        /* Interface Descriptor ? */
        case USB_DT_INTERFACE:
            USB_PRINTF0("### Endpoint Descriptor error.\n");
            return USB_ERROR;
            break;
        /* Endpoint Descriptor */
        case USB_DT_ENDPOINT:
            /* Bulk Endpoint */
            if( (table[ofdsc + 3] & USB_EP_TRNSMASK) == USB_EP_BULK )
            {
                switch( dirflag )
                {
                case 0:
                    retval = R_usb_hstd_ChkPipeInfo(speed, &usb_ghmsc_PipeTable[ptr->ip][offset], &table[ofdsc]);
                    if( retval == USB_DIR_H_OUT )
                    {
                        usb_ghmsc_OutPipe[ptr->ip][msgnum][0] = offset;
                    }
                    if( retval == USB_DIR_H_IN )
                    {
                        usb_ghmsc_InPipe[ptr->ip][msgnum][0] = offset;
                    }
                    dirflag++;
                    break;
                case 1:
                    retval = R_usb_hstd_ChkPipeInfo(speed, &usb_ghmsc_PipeTable[ptr->ip][offset + USB_EPL],
                                &table[ofdsc]);
                    if( retval == USB_DIR_H_OUT )
                    {
                        usb_ghmsc_OutPipe[ptr->ip][msgnum][0] = (uint16_t)(offset + USB_EPL);
                    }
                    if( retval == USB_DIR_H_IN )
                    {
                        usb_ghmsc_InPipe[ptr->ip][msgnum][0] = (uint16_t)(offset + USB_EPL);
                    }
                    if( (usb_ghmsc_InPipe[ptr->ip][msgnum][0] != USB_NOPORT) &&
                        (usb_ghmsc_OutPipe[ptr->ip][msgnum][0] != USB_NOPORT) )
                    {
                        return USB_DONE;
                    }
                    USB_PRINTF0("### Endpoint Descriptor error.\n");
                    break;
                default:
                    break;
                }
            }
            ofdsc += table[ofdsc];
            break;
        /* Device Qualifier Descriptor */
        case USB_DT_DEVICE_QUALIFIER:
        /* Other Speed Configuration Descriptor */
        case USB_DT_OTHER_SPEED_CONF:
        /* Interface Power Descriptor */
        case USB_DT_INTERFACE_POWER:
            USB_PRINTF0("### Endpoint Descriptor error.\n");
            return USB_ERROR;
            break;
        /* Antoher Descriptor */
        default:
            ofdsc += table[ofdsc];
            break;
        }
    }
    return USB_ERROR;
}   /* eof usb_hmsc_SmpPipeInfo() */

