pwbf/RX64M_ETHERNET/r_usb_hmsc/src/r_usb_hmsc_driver.c
/******************************************************************************
Function Name   : usb_hmsc_NoData
Description     : HMSC No data
Arguments       : uint16_t drvnum : 
Return value    : uint16_t : 
******************************************************************************/
uint16_t usb_hmsc_NoData(USB_UTR_t *ptr, uint16_t drvnum)
{
    USB_CLSINFO_t mess;

    mess.ip = ptr->ip;
    mess.ipp = ptr->ipp;

    mess.keyword = drvnum;
    usb_shmsc_Process[ptr->ip] = USB_MSG_HMSC_NO_DATA;
    usb_hmsc_SpecifiedPath(&mess);
    usb_shmsc_NoDataSeq[ptr->ip] = USB_SEQ_0;

    return USB_DONE;
}   /* eof usb_hmsc_NoData() */

/******************************************************************************
Function Name   : usb_hmsc_NoDataAct
Description     : No Data Request
Arguments       : USB_CLSINFO_t *mess : 
Return value    : uint16_t : 
******************************************************************************/
uint16_t usb_hmsc_NoDataAct(USB_CLSINFO_t *mess)
{
    uint16_t    hmsc_retval, result;
    uint16_t    drvnum;
    
    drvnum = usb_ghmsc_RootDrive[mess->ip];
    result = mess -> result;
    
    switch( usb_shmsc_NoDataSeq[mess->ip] )
    {
    case USB_SEQ_0:
        /* CBW */
        drvnum = mess -> keyword;
        usb_ghmsc_RootDrive[mess->ip] = drvnum;
        hmsc_retval = usb_hmsc_SendCbw(mess, drvnum);
        usb_shmsc_Process[mess->ip] = USB_MSG_HMSC_NO_DATA;
        usb_shmsc_NoDataSeq[mess->ip]++;
        usb_hmsc_SpecifiedPath((USB_CLSINFO_t *)mess);
        break;
    case USB_SEQ_1:
        hmsc_retval = usb_hmsc_SendCbwReq(mess, drvnum);
        usb_shmsc_Process[mess->ip] = USB_MSG_HMSC_NO_DATA;
        usb_shmsc_NoDataSeq[mess->ip]++;
        break;
    case USB_SEQ_2:
        hmsc_retval = usb_hmsc_SendCbwCheck(mess, drvnum, result);
        if( hmsc_retval == USB_DATA_STALL )
        {
            usb_shmsc_NoDataSeq[mess->ip] = USB_SEQ_0;
        }
        else if( hmsc_retval != USB_HMSC_OK )
        {
            USB_PRINTF1("### NoData : SendCbw error(drive:%d) \n", drvnum);
            usb_shmsc_NoDataSeq[mess->ip] = USB_SEQ_0;
            usb_hmsc_CommandResult(mess,hmsc_retval);
        }
        else
        {
            /* CSW */
            hmsc_retval = usb_hmsc_GetCsw(mess, drvnum);
            
            usb_shmsc_Process[mess->ip] = USB_MSG_HMSC_NO_DATA;
            usb_shmsc_NoDataSeq[mess->ip]++;
            usb_hmsc_SpecifiedPath((USB_CLSINFO_t *)mess);
        }
        break;
    case USB_SEQ_3:
        hmsc_retval = usb_hmsc_GetCswReq(mess, drvnum);
        usb_shmsc_Process[mess->ip] = USB_MSG_HMSC_NO_DATA;
        usb_shmsc_NoDataSeq[mess->ip]++;
        break;
    case USB_SEQ_4:
        hmsc_retval = usb_hmsc_GetCswCheck(mess, drvnum, result);

        switch( hmsc_retval )
        {
        case USB_HMSC_OK:
            if(usb_ghmsc_CswErrRoop[mess->ip] == USB_ON)
            {
                usb_ghmsc_CswErrRoop[mess->ip] = USB_OFF;
                hmsc_retval = USB_HMSC_CSW_ERR;
            }
            usb_hmsc_CommandResult(mess, hmsc_retval);
            break;
        case USB_HMSC_CSW_ERR:
            USB_PRINTF1("*** NoData : CSW-NG(drive:%d) \n", drvnum);
            usb_ghmsc_CswErrRoop[mess->ip] = USB_ON;
            drvnum = usb_ghmsc_RootDrive[mess->ip];
            R_usb_hmsc_RequestSense(mess, drvnum, (uint8_t *)usb_ghmsc_Data[mess->ip]);
            break;
        case USB_MSG_HMSC_DATA_STALL:
            USB_PRINTF1("*** NoData : CSW-STALL(drive:%d) \n", drvnum);
            usb_shmsc_Process[mess->ip] = USB_MSG_HMSC_DATA_STALL;
            mess->keyword = drvnum;
            usb_hmsc_SpecifiedPath((USB_CLSINFO_t *)mess);
            break;
        default:
            if(usb_ghmsc_CswErrRoop[mess->ip] == USB_ON)
            {
                usb_ghmsc_CswErrRoop[mess->ip]  =USB_OFF;
                hmsc_retval = USB_HMSC_CSW_ERR;
            }
            USB_PRINTF1("### NoData : GetCSW error(drive:%d) \n", drvnum);
            usb_hmsc_CommandResult(mess, hmsc_retval);
            break;
        }
        usb_shmsc_NoDataSeq[mess->ip] = USB_SEQ_0;
        break;
    default:
        usb_hmsc_CommandResult(mess, hmsc_retval);
        usb_shmsc_NoDataSeq[mess->ip] = USB_SEQ_0;
        break;
    }
    return (hmsc_retval);
}   /* eof usb_hmsc_NoDataAct() */

/******************************************************************************
Function Name   : usb_hmsc_DataIn
Description     : HMSC Data In
Arguments       : uint16_t drvnum : 
                : uint8_t *buff : 
                : uint32_t size : 
Return value    : uint16_t : 
******************************************************************************/
uint16_t usb_hmsc_DataIn(USB_UTR_t *ptr, uint16_t drvnum, uint8_t *buff, uint32_t size)
{
    USB_CLSINFO_t mess;

    mess.ip = ptr->ip;
    mess.ipp = ptr->ipp;

    mess.keyword = drvnum;

    usb_ghmsc_Buff[ptr->ip] = buff;
    usb_ghmsc_TransSize[ptr->ip] = size;

    usb_shmsc_Process[ptr->ip] = USB_MSG_HMSC_DATA_IN;
    usb_hmsc_SpecifiedPath(&mess);
    usb_shmsc_DataInSeq[ptr->ip] = USB_SEQ_0;

    return USB_DONE;
}   /* eof usb_hmsc_DataIn() */

/******************************************************************************
Function Name   : usb_hmsc_DataInAct
Description     : Receive Data request
Arguments       : USB_CLSINFO_t *mess : 
Return value    : uint16_t : 
******************************************************************************/
uint16_t usb_hmsc_DataInAct(USB_CLSINFO_t *mess)
{
    uint16_t    hmsc_retval, result;
    uint16_t    drvnum;
    uint32_t    size;
    uint8_t     *buff;

    drvnum = usb_ghmsc_RootDrive[mess->ip];
    buff = usb_ghmsc_Buff[mess->ip];
    size = usb_ghmsc_TransSize[mess->ip];
    result = mess -> result;

    switch( usb_shmsc_DataInSeq[mess->ip] )
    {
    case USB_SEQ_0:
        /* CBW */
        drvnum = mess -> keyword;
        usb_ghmsc_RootDrive[mess->ip] = drvnum;
        hmsc_retval = usb_hmsc_SendCbw(mess, drvnum);
        usb_shmsc_Process[mess->ip] = USB_MSG_HMSC_DATA_IN;
        usb_shmsc_DataInSeq[mess->ip]++;
        usb_hmsc_SpecifiedPath((USB_CLSINFO_t *)mess);
        break;
    case USB_SEQ_1:
        hmsc_retval = usb_hmsc_SendCbwReq(mess, drvnum);
        usb_shmsc_DataInSeq[mess->ip]++;
        break;
    case USB_SEQ_2:
        hmsc_retval = usb_hmsc_SendCbwCheck(mess, drvnum, result);
        if( hmsc_retval == USB_DATA_STALL )
        {
            usb_shmsc_DataInSeq[mess->ip] = USB_SEQ_0;
        }
        else if( hmsc_retval != USB_HMSC_OK )
        {
            USB_PRINTF1("### DataIN : SendCBW error(drive:%d) \n", drvnum);
            usb_shmsc_DataInSeq[mess->ip] = USB_SEQ_0;
            usb_hmsc_CommandResult(mess, hmsc_retval);
        }
        else
        {
/* Data */
            hmsc_retval = usb_hmsc_GetData(mess, drvnum, buff, size);
            usb_shmsc_Process[mess->ip] = USB_MSG_HMSC_DATA_IN;
            usb_shmsc_DataInSeq[mess->ip]++;
            usb_hmsc_SpecifiedPath((USB_CLSINFO_t *)mess);
        }
        break;
    case USB_SEQ_3:
        hmsc_retval = usb_hmsc_GetDataReq(mess, drvnum, buff, size);
        usb_shmsc_Process[mess->ip] = USB_MSG_HMSC_DATA_IN;
        usb_shmsc_DataInSeq[mess->ip]++;
        break;
    case USB_SEQ_4:
        hmsc_retval = usb_hmsc_GetDataCheck(mess, drvnum, result);
        if( hmsc_retval == USB_HMSC_STALL )
        {
            usb_shmsc_Process[mess->ip] = USB_MSG_HMSC_DATA_IN;
            usb_shmsc_DataInSeq[mess->ip]++;
        }
        else if( hmsc_retval != USB_HMSC_OK )
        {
            USB_PRINTF1("### DataIN : GetData error(drive:%d) \n", drvnum);
            usb_hmsc_CommandResult(mess, hmsc_retval);
            usb_shmsc_DataInSeq[mess->ip] = USB_SEQ_0;
        }
        else
        {
            /* CSW */
            hmsc_retval = usb_hmsc_GetCsw(mess, drvnum);

