pwbf/RX64M_ETHERNET/r_usb_hmsc/src/r_usb_hmsc_driver.c
/******************************************************************************
Function Name   : usb_hmsc_SpecifiedPath
Description     : Next Process Selector
Arguments       : USB_CLSINFO_t *mess : 
Return value    : none
******************************************************************************/
void usb_hmsc_SpecifiedPath(USB_CLSINFO_t *mess)
{
    USB_MH_t            p_blf;
    USB_ER_t            err;
    USB_CLSINFO_t       *ptr;

    /* Get mem pool blk */
    if( R_USB_PGET_BLK(USB_HMSC_MPL, &p_blf) == USB_E_OK )
    {
        ptr = (USB_CLSINFO_t*)p_blf;
        ptr->msginfo    = usb_shmsc_Process[mess->ip];
        ptr->keyword    = mess->keyword;
        ptr->result     = mess->result;

        ptr->ip         = mess->ip;
        ptr->ipp        = mess->ipp;

        /* Send message */
        err = R_USB_SND_MSG(USB_HMSC_MBX, (USB_MSG_t*)p_blf);
        if( err != USB_E_OK )
        {
            err = R_USB_REL_BLK(USB_HMSC_MPL,(USB_MH_t)p_blf);
            USB_PRINTF0("### SpecifiedPass function snd_msg error\n");
        }
    }
    else
    {
        USB_PRINTF0("### SpecifiedPass function pget_blk error\n");
    }
}   /* eof usb_hmsc_SpecifiedPath() */

/******************************************************************************
Function Name   : usb_hmsc_CheckResult
Description     : Hub class check result
Arguments       : USB_UTR_t *mess : 
Return value    : none
******************************************************************************/
void usb_hmsc_CheckResult(USB_UTR_t *mess, uint16_t data1, uint16_t data2)
{
    USB_MH_t            p_blf;
    USB_ER_t            err;
    USB_CLSINFO_t       *ptr;

    ptr = mess;
    if( mess->status == USB_DATA_STALL )
    {
        ptr->msginfo    = usb_shmsc_Process[mess->ip];
    }
    
    /* Get mem pool blk */
    if( R_USB_PGET_BLK(USB_HMSC_MPL, &p_blf) == USB_E_OK )
    {
        ptr = (USB_CLSINFO_t*)p_blf;
        ptr->msginfo    = usb_shmsc_Process[mess->ip];
        ptr->keyword    = mess->keyword;
        ptr->result     = mess->status;

        ptr->ip         = mess->ip;
        ptr->ipp        = mess->ipp;

        /* Send message */
        err = R_USB_SND_MSG( USB_HMSC_MBX, (USB_MSG_t*)p_blf );
        if( err != USB_E_OK )
        {
            err = R_USB_REL_BLK(USB_HMSC_MPL,(USB_MH_t)p_blf);
            USB_PRINTF0("### CheckResult function snd_msg error\n");
        }
    }
    else
    {
        USB_PRINTF0("### CheckResult function pget_blk error\n");
    }
}   /* eof usb_hmsc_CheckResult() */

/******************************************************************************
Function Name   : usb_hmsc_class_check_result
Description     : Hub class check result
Arguments       : USB_UTR_t *mess : 
Return value    : none
******************************************************************************/
void usb_hmsc_class_check_result(USB_UTR_t *mess, uint16_t data1, uint16_t data2)
{
    USB_MH_t            p_blf;
    USB_ER_t            err;
    USB_CLSINFO_t       *ptr;

    ptr = mess;

    /* Get mem pool blk */
    if( R_USB_PGET_BLK(USB_HMSC_MPL, &p_blf) == USB_E_OK )
    {
        ptr = (USB_CLSINFO_t*)p_blf;
        ptr->msginfo    = USB_MSG_CLS_INIT;
        ptr->keyword    = mess->keyword;
        ptr->result     = mess->status;

        ptr->ip         = mess->ip;
        ptr->ipp        = mess->ipp;

        /* Send message */
        err = R_USB_SND_MSG( USB_HMSC_MBX, (USB_MSG_t*)p_blf );
        if( err != USB_E_OK )
        {
            err = R_USB_REL_BLK(USB_HMSC_MPL,(USB_MH_t)p_blf);
            USB_PRINTF0("### usb_hmsc_class_check_resultn snd_msg error\n");
        }
    }
    else
    {
        USB_PRINTF0("### usb_hmsc_class_check_result pget_blk error\n");
    }
}   /* eof usb_hmsc_class_check_result() */

/******************************************************************************
Function Name   : usb_hmsc_StallErr
Description     : HMSC Stall Error
Arguments       : USB_UTR_t *ptr : 
Return value    : none
******************************************************************************/
void usb_hmsc_StallErr(USB_UTR_t *ptr)
{
    uint16_t    drvnum, msgnum, result;
    uint16_t    hub_addr,hub_port_no;
    USB_ER_t    err,err2;
    USB_MH_t    p_blf;
    USB_UTR_t   *cp;
    USB_UTR_t   devadr;

    drvnum = usb_ghmsc_RootDrive[ptr->ip];
    result = ptr->status;
    msgnum = usb_hmsc_SmpDrive2Msgnum(ptr, drvnum);
    if( USB_ERROR == msgnum )
    {
        return;
    }

    switch( usb_shmsc_StallErrSeq[ptr->ip] )
    {
    case USB_SEQ_0:
        drvnum = ptr->keyword;
        /* Device address set */
        usb_hmsc_SmpDrive2Addr( drvnum, &devadr );

        /* Get connected Hub address from Device address. */
        hub_addr = R_usb_hhub_get_hub_addr(ptr, devadr.keyword);

        /* Get connected Hub port number from Device address. */
        hub_port_no = R_usb_hhub_get_hub_port_no(ptr, devadr.keyword);

        /* Transfer Get Port Status when get Hub address and connected Hub port no. */
        if( (hub_addr != USB_ERROR) && (hub_port_no != USB_ERROR) )
        {
            /* Get Port Status(GET_STATUS) */
            R_usb_hhub_GetPortInformation(ptr, hub_addr, hub_port_no, (USB_CB_t)usb_hmsc_CheckResult );
            usb_shmsc_StallErrSeq[ptr->ip] = USB_SEQ_4;
        }
        else
        {
            usb_ghmsc_RootDrive[ptr->ip] = drvnum;

            err = R_usb_hmsc_MassStorageReset(ptr, drvnum, (USB_CB_t)usb_hmsc_CheckResult);
            /* Control Transfer overlaps */
            if( err == USB_E_QOVR )
            {
                /* Resend message */
                err = R_USB_PGET_BLK(USB_HMSC_MPL, &p_blf);
                if( err == USB_E_OK )
                {
                    cp = (USB_UTR_t*)p_blf;
                    cp->msginfo = ptr -> msginfo;
                    cp->keyword = ptr -> keyword;
                    cp->status  = ptr -> status;

                    cp->ip      = ptr->ip;
                    cp->ipp     = ptr->ipp;

                    /* Send message */
                    err = USB_SND_MSG(USB_HMSC_MBX, (USB_MSG_t*)p_blf);
                    if( err != USB_E_OK )
                    {
                        USB_PRINTF1("### StallErr snd_msg error (%ld)\n", err);
                        err2 = R_USB_REL_BLK(USB_HMSC_MPL, (USB_MH_t)p_blf);
                        if( err2 != USB_E_OK )
                        {
                            USB_PRINTF1("### StallErr rel_blk error (%ld)\n", err2);
                        }
                    }
                }
                else
                {
                    USB_PRINTF1("### StallErr pget_blk error (%ld)\n", err);
                }
            }
            else
            {
                /* Control Transfer not overlaps */
                usb_shmsc_StallErrSeq[ptr->ip]++;
            }
        }
        break;

