pwbf/RX64M_ETHERNET/r_usb_hmsc/src/r_usb_hmsc_driver.c
    case USB_SEQ_1:
        usb_hmsc_MassStorageResetCheck(ptr, result);
        R_usb_hmsc_ClearStall(ptr, (uint16_t)USB_DATA_NONE, msgnum,
             usb_hmsc_CheckResult);
        usb_shmsc_StallErrSeq[ptr->ip]++;
        break;
    case USB_SEQ_2:
        usb_hmsc_ClearStallCheck(ptr, result);
        R_usb_hmsc_ClearStall(ptr, (uint16_t)USB_DATA_OK, msgnum,
             usb_hmsc_CheckResult);
        usb_shmsc_StallErrSeq[ptr->ip]++;
        break;
    case USB_SEQ_3:
        usb_hmsc_ClearStallCheck(ptr, result);
        if( ptr->msginfo == USB_MSG_HMSC_CSW_PHASE_ERR )
        {
            result = USB_HMSC_CSW_PHASE_ERR;
        }
        else
        {
            result = USB_HMSC_CBW_ERR;
        }
        usb_hmsc_CommandResult(ptr, result);
        usb_shmsc_StallErrSeq[ptr->ip] = USB_SEQ_0;
        break;

    case USB_SEQ_4:
        drvnum = (uint16_t)ptr->usr_data;                               /* Device no. set */
        /* Device address set */
        usb_hmsc_SmpDrive2Addr( drvnum, &devadr );

        /* Get connected Hub address from Device address. */
        hub_addr = R_usb_hhub_get_hub_addr(ptr, devadr.keyword);

        /* Check device connect status for after transfer complete GET_STATUS(Get Port Status) */
        if( R_usb_hhub_chk_connect_status(ptr, hub_addr) == USB_DEV_NO_CONNECT )
        {
            if( ptr->msginfo == USB_MSG_HMSC_CSW_PHASE_ERR )
            {
                result = USB_HMSC_CSW_PHASE_ERR;
            }
            else
            {
                result = USB_HMSC_CBW_ERR;
            }
            usb_hmsc_CommandResult(ptr, result);
            usb_shmsc_StallErrSeq[ptr->ip] = USB_SEQ_0;
        }
        else
        {
            usb_ghmsc_RootDrive[ptr->ip] = drvnum;

            err = R_usb_hmsc_MassStorageReset(ptr, drvnum, (USB_CB_t)usb_hmsc_CheckResult);
            /* Control Transfer overlaps */
            if( err == USB_E_QOVR )
            {
                /* Resend message */
                err = R_USB_PGET_BLK(USB_HMSC_MPL, &p_blf);
                if( err == USB_E_OK )
                {
                    cp = (USB_UTR_t*)p_blf;
                    cp->msginfo = ptr -> msginfo;
                    cp->keyword = ptr -> keyword;
                    cp->status  = ptr -> status;

                    cp->ip      = ptr->ip;
                    cp->ipp     = ptr->ipp;

                    /* Send message */
                    err = R_USB_SND_MSG(USB_HMSC_MBX, (USB_MSG_t*)p_blf);
                    if( err != USB_E_OK )
                    {
                        USB_PRINTF1("### StallErr snd_msg error (%ld)\n", err);
                        err2 = R_USB_REL_BLK(USB_HMSC_MPL, (USB_MH_t)p_blf);
                        if( err2 != USB_E_OK )
                        {
                            USB_PRINTF1("### StallErr rel_blk error (%ld)\n", err2);
                        }
                    }
                }
                else
                {
                    USB_PRINTF1("### StallErr pget_blk error (%ld)\n", err);
                }
            }
            else
            {
                /* Control Transfer not overlaps */
                usb_shmsc_StallErrSeq[ptr->ip] = USB_SEQ_1;
            }
        }
        break;

    default:
        if( ptr->msginfo == USB_MSG_HMSC_CSW_PHASE_ERR )
        {
            result = USB_HMSC_CSW_PHASE_ERR;
        }
        else
        {
            result = USB_HMSC_CBW_ERR;
        }
        usb_hmsc_CommandResult(ptr, result);
        usb_shmsc_StallErrSeq[ptr->ip] = USB_SEQ_0;
        break;
    }
}   /* eof usb_hmsc_StallErr() */

/******************************************************************************
Function Name   : usb_hmsc_DataStall
Description     : HMSC Data Stall
Arguments       : USB_UTR_t *mess : 
Return value    : none
******************************************************************************/
void usb_hmsc_DataStall(USB_UTR_t *mess)
{
    uint16_t result, status, drvnum, msgnum, hmsc_retval;
    USB_CLSINFO_t *ptr;

    drvnum = usb_ghmsc_RootDrive[mess->ip];
    ptr = (USB_CLSINFO_t*)mess;
    result = ptr->result;
    status = mess->status;

    msgnum = usb_hmsc_SmpDrive2Msgnum(mess, drvnum);
    if( USB_ERROR == msgnum )
    {
        return;
    }

    switch( usb_shmsc_DataStallSeq[mess->ip] )
    {
    case USB_SEQ_0:
        drvnum = mess->keyword;
        usb_ghmsc_RootDrive[mess->ip] = drvnum;

        R_usb_hmsc_ClearStall(mess, (uint16_t)USB_DATA_OK, msgnum, usb_hmsc_CheckResult);
        usb_shmsc_Process[mess->ip] = USB_MSG_HMSC_DATA_STALL;
        usb_shmsc_DataStallSeq[mess->ip]++;
        break;
    case USB_SEQ_1:
        usb_hmsc_ClearStallCheck(mess, status);
        usb_hmsc_GetCsw(mess, drvnum);
        usb_shmsc_Process[mess->ip] = USB_MSG_HMSC_DATA_STALL;
        usb_hmsc_SpecifiedPath((USB_CLSINFO_t *)mess);
        usb_shmsc_DataStallSeq[mess->ip]++;
        break;
    case USB_SEQ_2:
        usb_hmsc_GetCswReq(mess, drvnum);
        usb_shmsc_Process[mess->ip] = USB_MSG_HMSC_DATA_STALL;
        usb_shmsc_DataStallSeq[mess->ip]++;
        break;
    case USB_SEQ_3:
        hmsc_retval = usb_hmsc_GetCswCheck(mess, drvnum,result);
        switch( hmsc_retval )
        {
        case USB_HMSC_OK:
            if( usb_ghmsc_CswErrRoop[mess->ip] == USB_ON )
            {
                usb_ghmsc_CswErrRoop[mess->ip] = USB_OFF;
                hmsc_retval = USB_HMSC_CSW_ERR;
            }
            usb_hmsc_CommandResult(mess, hmsc_retval);
            break;
        case USB_HMSC_CSW_ERR:
            USB_PRINTF1("*** DataOUT : CSW-NG(drive:%d) \n", drvnum);
            usb_ghmsc_CswErrRoop[mess->ip] = USB_ON;
            drvnum = usb_ghmsc_RootDrive[mess->ip];
            R_usb_hmsc_RequestSense(mess, drvnum, (uint8_t*)usb_ghmsc_Data[mess->ip]);
            break;
        case USB_MSG_HMSC_DATA_STALL:
            usb_shmsc_Process[mess->ip] = USB_MSG_HMSC_CSW_PHASE_ERR;
            mess->keyword = drvnum;
            usb_hmsc_SpecifiedPath((USB_CLSINFO_t *)mess);
            USB_PRINTF1("*** DataOUT : Phase error(drive:%d) \n", drvnum);
            break;
        default:
            if( usb_ghmsc_CswErrRoop[mess->ip] == USB_ON )
            {
                usb_ghmsc_CswErrRoop[mess->ip] = USB_OFF;
                hmsc_retval = USB_HMSC_CSW_ERR;
            }
            USB_PRINTF1("### DataOUT : GetCSW error(drive:%d) \n", drvnum);
            usb_hmsc_CommandResult(mess, hmsc_retval);
            break;
        }
        usb_shmsc_DataStallSeq[mess->ip] = USB_SEQ_0;
        break;
    default:
        usb_hmsc_CommandResult(mess,USB_HMSC_CSW_ERR);
        usb_shmsc_DataStallSeq[mess->ip] = USB_SEQ_0;
        break;
    }
}   /* eof usb_hmsc_DataStall() */

/******************************************************************************
Function Name   : usb_hmsc_CommandResult
Description     : Hub class check result
Arguments       : uint16_t result     : Result
Return value    : none
******************************************************************************/
void usb_hmsc_CommandResult(USB_UTR_t *ptr, uint16_t result)
{
    USB_MH_t            p_blf;
    USB_ER_t            err;
    USB_CLSINFO_t       *cp;
    
    /* Get mem pool blk */
    if( R_USB_PGET_BLK(USB_HSTRG_MPL,&p_blf) == USB_E_OK )
    {
        cp = (USB_CLSINFO_t*)p_blf;
        cp->msginfo = usb_shmsc_StrgProcess[ptr->ip];
        cp->result  = result;

        cp->ip      = ptr->ip;
        cp->ipp     = ptr->ipp;

        /* Send message */
        err = R_USB_SND_MSG( USB_HSTRG_MBX, (USB_MSG_t*)p_blf );
        if( err != USB_E_OK )
        {
            err = R_USB_REL_BLK(USB_HSTRG_MPL,(USB_MH_t)p_blf);
            USB_PRINTF0("### CheckResult function snd_msg error\n");
        }
    }
    else
    {
        USB_PRINTF0("### CheckResult function pget_blk error\n");
    }
}   /* eof usb_hmsc_CommandResult() */

/******************************************************************************
End  Of File
******************************************************************************/
